In [1]:
import pandas as pd
import re

In [2]:
# importing Samsung csv
samsung = pd.read_csv('../data/samsung.csv')

In [3]:
samsung.head()

         Date     Open     High      Low    Close  Adj Close      Volume
0  2014-11-20  24120.0  24400.0  24120.0  24200.0  65.440697  10024150.0
1  2014-11-21  24380.0  24520.0  24340.0  24460.0  66.143776  12336350.0
2  2014-11-24  24940.0  24960.0  24200.0  24400.0  65.981522  10284300.0
3  2014-11-25  24480.0  24480.0  23800.0  23800.0  64.359032  17811050.0
4  2014-11-26  23800.0  24220.0  23640.0  24020.0  64.953957  12287900.0

In [4]:
# as I want to show just one value per day, I choos the 'Adj Close' Value:
samsung.drop(columns = ['Volume', 'Open', 'High', 'Low', 'Close'], inplace = True)

In [5]:
samsung.rename(columns = {'Adj Close':'Value'}, inplace = True)

In [6]:
samsung.dtypes

Date      object
Value    float64
dtype: object

In [7]:
# changing tipe of Date from object to Datetime
samsung['Date'] = pd.to_datetime(samsung['Date'])

In [8]:
# Rounding values to 2 decimals
samsung['Value'] = samsung['Value'].round(decimals = 2)

In [16]:
samsung.isnull().values.sum()

6

In [17]:
samsung.query('Value == "NaN"')

           Date  Value
1153 2019-08-02    NaN
1174 2019-09-03    NaN
1179 2019-09-10    NaN
1194 2019-10-04    NaN
1219 2019-11-11    NaN
1223 2019-11-15    NaN

In [21]:
# there are just 6 values with NaN, so I will replace them with an average of the previous and next values:
for i in samsung.query('Value == "NaN"').index:
    samsung.loc[i, 'Value'] = (samsung.loc[i-1,'Value']+samsung.loc[i+1, 'Value'])/2

In [22]:
samsung.isnull().values.sum()

0

In [27]:
# As Bitcoin data starts from 2017/01/01, I will keep just the data from that date.
samsung = samsung.loc[samsung['Date'] >= '2017-01-01']

In [28]:
# Resetting index
samsung.reset_index(drop = True, inplace = True)

In [29]:
# Samsung data is ready: Date column and its corresponding value.
samsung.head()

        Date    Value
0 2017-01-02  7630.11
1 2017-01-03  7710.43
2 2017-01-04  7642.79
3 2017-01-05  7515.97
4 2017-01-06  7651.25

In [30]:
# Saving the dataframe into a new csv file
samsung.to_csv('../data/cleaned_data/samsung_clean.csv')